{
  "navbar": {
    "items": {
      "about": "About",
      "experience": "Experience",
      "projects": "Projects",
      "contact": "Contact"
    },
    "resume": "resume",
    "alternative_language": "Português"
  },
  "introduction": {
    "hi": "Hi, I'm",
    "job_separator": "and",
    "short": "I'm a software developer who can work well on every development layer. I live next to Brasília, Brazil. I work as a full-stack developer at <0>{{company}}</0>. I'm currently not seeking job opportunities. However, my inbox it's always open to chat about any topic.",
    "hire_me": "hire me",
    "contact_me": "contact me"
  },
  "about": {
    "title": "Who I Am",
    "first": "Hey there, my name is Artur. I enjoy creating things. My first contact with code was with Game Maker when I was 14, which made me fall in love with development. Since then, I have been passing through some technologies and other fields of software development.",
    "second": {
      "game": "I enjoy playing video games for as far as I can remember. When I discovered that I could also make them it was a game-changer in my life. Since college, I have been having fun developing some. I have spent some years doing it professionally but nowadays is more of a hobby.",
      "web": "Although I am a full-stack web developer who can work perfectly with both the back and front end, lately, I've been working mainly with the \"muscles\" of the interfaces. I'm used to building APPs with available UI kits. However, when required, I design as well. On the server side, I care a lot about security and following good practices to prevent future problems."
    },
    "third": "I love dogs, music and pizza. In my free time, I enjoy going to the gym, playing video games and coding small projects.",
    "technologies": "Technologies that I have been using lately:"
  },
  "experience": {
    "title": "Education and Work",
    "at": "at",
    "experiences": {
      "roundstars": {
        "title": "Game Developer",
        "subtitle": "Programmer",
        "content": "Developed single-player and multiplayer games, implementing gameplay mechanics, AI bots, and user interfaces. Contributed to design and testing of features. Also supported backend integration by helping build a REST API for a gaming social media platform, enhancing collaboration and community interaction."
      },
      "adra_brasil": {
        "title": "Designer",
        "subtitle": "Automation & Design",
        "content": "Worked on creative design and process automation for a nonprofit organization. Created art for campaigns, automated recurring tasks with VBA and SQL, and developed a Laravel and Vue application to optimize hot meal distribution to Venezuelan refugees, improving efficiency and supporting social initiatives."
      },
      "adven_tech": {
        "title": "Web Developer",
        "subtitle": "Fullstack",
        "content": "Developed web applications for stock management, event planning, and e-commerce platforms. Modernized legacy systems by migrating to updated technologies. Delivered robust, scalable solutions across back-end and front-end environments, ensuring maintainability and usability while supporting diverse client demands with flexibility and technical expertise."
      },
      "autotrac": {
        "title": "Web Developer",
        "subtitle": "Front-end Focused",
        "content": "Focused on building Angular interfaces, improving usability, and refactoring components for better performance. Contributed to .NET back-end integration, supporting communication between systems. Worked closely with the team to deliver consistent features, optimize workflows, and enhance overall user experience within enterprise-level applications."
      },
      "iesb": {
        "title": "Associate Degree",
        "subtitle": "Game Development",
        "content": "Studied object-oriented programming, 2D and 3D art, audio, and level design. Participated in game creation projects, winning an award for best game in 2017. Acquired additional skills in web and mobile development, strengthening adaptability and broadening knowledge beyond the core focus on game production."
      },
      "descomplica_systems": {
        "title": "Postgraduate",
        "subtitle": "Systems Analysis",
        "content": "Specialization focused on theoretical and practical aspects of system development. Explored data structures, project management, and DevOps practices. Gained knowledge in planning, analyzing, and implementing systems, with emphasis on methodologies that improve efficiency, reliability, and collaboration in software engineering environments."
      },
      "descomplica_mobile": {
        "title": "Postgraduate",
        "subtitle": "Mobile Development",
        "content": "Focused on mobile development, covering hybrid frameworks and fundamentals of native Android and iOS programming. Studied modern tools and best practices for building efficient, cross-platform solutions. Gained experience in designing, testing, and deploying mobile applications that meet current technology trends and industry needs."
      },
      "descomplica_cc": {
        "title": "Bachelor’s Degree",
        "subtitle": "Computer Science",
        "content": "Comprehensive study of algorithms, data structures, software engineering, operating systems, databases, and networks. Gained advanced programming and system design skills. Explored artificial intelligence, distributed systems, and security, preparing for professional roles in software engineering, research, and technology innovation across diverse computing environments."
      }
    }
  },
  "projects": {
    "title": "Projects",
    "instructions": "Hover the project card to see its links.",
    "instructions_mobile": "Tap on the project card to see its links.",
    "projects": {
      "todo": {
        "name": "ToDo App",
        "description": "It's a simple To-Do app. I made it mainly to show my technical knowledge of the Angular framework. It has unit tests for basic functionalities, is mobile-first designed, has PWA support, and uses firebase's realtime database."
      },
      "trivia": {
        "name": "Trivia Game",
        "description": "It is a simple quiz game powered by Open Trivia Database. It allows you to choose a topic, time limit and others settings to customize your experience."
      },
      "secret_santa": {
        "name": "Secret Santa",
        "description": "This one might be the simplest here. I made it to help with my family's holiday Secret Santa. It allows you quick create one and send the links to the participants so they can see who they got."
      },
      "portfolio": {
        "name": "Portfolio",
        "description": "Its main objective is to show some of my projects and talk a little about me. It uses SendingBlue for contact and a single cloud function to keep it safe."
      },
      "pru": {
        "name": "Pru!",
        "description": "Pru! is an \"infinity runner\" of a pigeon who needs to eat food and score by hitting people with its poop while avoiding obstacles. It was the first game that I made back in college. It has gone through some changes since I first thought about it."
      },
      "jimmy_gunner": {
        "name": "Jimmy Gunner",
        "description": "It is a twin stick shooter that I made while playing with voxel art back in college. It is the game that gave me the best game of the semester award. I tried to remade it some years later but left this idea aside because of the number of similar games available."
      },
      "slime_run": {
        "name": "Slime Run",
        "description": "This game is about a world invaded by slimes. The hero's job is to get rid of them by jumping on their head while running, gliding and collecting coins to be used later on outfits."
      }
    }
  },
  "contact": {
    "title": "Get In Touch",
    "description": "Feel free to contact me and I'll get back to you as soon as possible.",
    "form": {
      "name": {
        "label": "Name",
        "required": "Name is necessary",
        "max_length": "Name is too long"
      },
      "email": {
        "label": "Email",
        "required": "Email is necessary",
        "not_valid": "Email is not valid"
      },
      "message": {
        "label": "Message",
        "required": "Message is necessary",
        "placeholder": "Write here your message",
        "max_length": "Please, write a shorter message"
      },
      "submit_button": "submit",
      "submit_success": {
        "title": "Email successfully sent!",
        "description": "Thanks for the message. I'll do my best to answer you on <strong>{{email}}</strong> as soon as possible.",
        "button": "Send Another Message"
      },
      "submit_error": {
        "title": "I'm sorry, looks like the email couldn't be sent right now.",
        "description": "But don't worry you can try again later or email me on"
      }
    },
    "disabled_notice": "I'm sorry, I had to disable the contact form. If you want to talk to me, please send an email to"
  },
  "common": {
    "made_by": "Made with ❤️ by Artur Junior",
    "date": {
      "present": "Present"
    }
  },
  "job_instructions": {
    "text": "Hi there, Even though I have been focusing on web development lately, I'm also a skilled game developer. You can click any time on \"Web\" or \"Game\" to see some changes on the page content.",
    "got_it": "Got It"
  }
}