{
  "navbar": {
    "items": {
      "about": "About",
      "experience": "Experience",
      "projects": "Projects",
      "contact": "Contact"
    },
    "resume": "resume",
    "alternative_language": "Português"
  },
  "introduction": {
    "hi": "Hi, my name is",
    "job_separator": "and",
    "short": "I'm a software developer who can work well on every development layer. I live next to Brasília, Brazil. I'm open to job offers on-site nearby or remotely anywhere around the globe.",
    "hire_me": "hire me"
  },
  "about": {
    "title": "Who I Am",
    "first": "Hey there, my name is Artur. I enjoy creating things. My first contact with code was with Game Maker when I was 14, which made me fall in love with development. Since then, I have been passing through some technologies and other fields of software development.",
    "second": {
      "game": "I enjoy playing video games for as far as I can remember. When I discovered that I could also make them it was a game-changer in my life. Since college, I have been having fun developing some. I have spent some years doing it professionally but nowadays is more of a hobby.",
      "web": "Although I am a full-stack web developer who can work perfectly with both the back and front end, lately, I've been working mainly with the \"muscles\" of the interfaces. I'm used to building APPs with available UI kits. However, when required, I design as well. On the server side, I care a lot about security and following good practices to prevent future problems."
    },
    "third": "I love dogs, music and pizza. In my free time, I enjoy going to the gym, playing video games and coding small projects.",
    "technologies": "Technologies that I have been using lately:"
  },
  "experience": {
    "title": "Education and Work",
    "experiences": {
      "roundstars": {
        "title": "Game Developer",
        "content": "<p>Worked on developing single-player and multiplayer games. Coding core mechanism, search algorithms and bots AIs. Programming, making interfaces and arts for those games.</p><p>Wrote clean C# code for games on Unity Engine.</p><p>Helped with a REST API for a social media for games with PHP and MySQL.</p>"
      },
      "adra_brasil": {
        "title": "Designer",
        "content": "<p>Worked with a little bit of everything. I helped with the automation of daily tasks with VBA and SQL. Made art for fundraising campaigns. Developed a system with Laravel and Vue to help with the distribution of hot meals for Venezuelan refugees.</p>"
      },
      "adven_tech": {
        "title": "Full Stack Developer",
        "content": "<p>Worked developing web apps as a stock management, event, e-commerce and other systems on client demand. I also helped to migrate legacy systems to modern technologies.</p><p>Written clean and scalable code for the back and front end. Worked with popular technologies such as Angular, React, .NET, C#, SQL and others.</p>"
      },
      "iesb": {
        "title": "Graduation on Game Development",
        "content": "<p>learned the concepts of object-oriented programming. Had contact with every layer of game development, including audio, 2D and 3D art, programming, level design and others. Won a prize for the best game made in the course of the second semester of 2017.</p><p>Even though the graduation had a heavy focus on game development, I also had contact with web and app development.</p>"
      },
      "descomplica": {
        "title": "Post Graduation at Two Courses",
        "content": "<p><strong>System Analysis and Development</strong> focuses mostly on the theoretical part of developing a system. I studied data structure, project management, DevOps and other development-related topics.</p><p><strong>Mobile Development</strong> As the name suggests, we had mobile related classes, like the most recent frameworks that have been used for hybrid development as well the basics of IOS and Android native apps.</p>"
      },
      "arkads_games": {
        "title": "Game Developer",
        "content": "<p>Arkads Games is kind of a pseudonym that I use for my game development hobby. Even though I do not develop games as a job nowadays, I still love making them for fun. Despite not having time to do it, and not and not making money with them, I still wish to keep doing it as a hobby.</p>"
      }
    }
  },
  "projects": {
    "title": "Projects",
    "instructions": "Hover the project card to see its links.",
    "instructions_mobile": "Tap on the project card to see its links.",
    "projects": {
      "todo": {
        "name": "ToDo App",
        "description": "It's a simple To-Do app. I made it mainly to show my technical knowledge of the Angular framework. It has unit tests for basic functionalities, is mobile-first designed, has PWA support, and uses firebase's realtime database."
      },
      "trivia": {
        "name": "Trivia Game",
        "description": "It is a simple quiz game powered by Open Trivia Database. It allows you to choose a topic, time limit and others settings to customize your experience."
      },
      "secret_santa": {
        "name": "Secret Santa",
        "description": "This one might be the simplest here. I made it to help with my family's holiday Secret Santa. It allows you quick create one and send the links to the participants so they can see who they got."
      },
      "portfolio": {
        "name": "Portfolio",
        "description": "Its main objective is to show some of my projects and talk a little about me. It uses SendingBlue for contact and a single cloud function to keep it safe."
      },
      "pru": {
        "name": "Pru!",
        "description": "Pru! is an \"infinity runner\" of a pigeon who needs to eat food and score by hitting people with its poop while avoiding obstacles. It was the first game that I made back in college. It has gone through some changes since I first thought about it."
      },
      "jimmy_gunner": {
        "name": "Jimmy Gunner",
        "description": "It is a twin stick shooter that I made while playing with voxel art back in college. It is the game that gave me the best game of the semester award. I tried to remade it some years later but left this idea aside because of the number of similar games available."
      },
      "slime_run": {
        "name": "Slime Run",
        "description": "This game is about a world invaded by slimes. The hero's job is to get rid of them by jumping on their head while running, gliding and collecting coins to be used later on outfits."
      }
    }
  }
}