{
  "navbar": {
    "items": {
      "about": "Sobre",
      "experience": "Experiência",
      "projects": "Projetos",
      "contact": "Contato"
    },
    "resume": "currículo",
    "alternative_language": "English"
  },
  "introduction": {
    "hi": "Oi, sou o",
    "job_separator": "e",
    "short": "Sou um desenvolvedor de software que trabalha bem em todas as camadas do desenvolvimento. Moro perto de Brasília, Brasil. Estou trabalhando como desenvolvedor full-stack na <0>{{company}}</0>. A pesar de não está procurando ofertas de emprego, estou sempre disposto a conversar sobre qualquer assunto.",
    "hire_me": "trabalhe comigo",
    "contact_me": "fale comigo"
  },
  "about": {
    "title": "Quem Eu Sou",
    "first": "Olá, meu nome é Artur. Eu gosto de criar coisas. Meu primeiro contato com código foi com o Game Maker aos 14 anos, o que me fez apaixonar por desenvolvimento. Desde então, tenho passado por várias tecnologias e outras áreas do desenvolvimento.",
    "second": {
      "game": "Eu gosto de jogar videogames desde que me lembro. Quando descobri que poderia desenvolver os meus próprios, foi uma virada de jogo em minha vida. Desde a faculdade, tenho me divertido desenvolvendo alguns. Passei alguns anos fazendo isso profissionalmente, mas hoje em dia é mais um hobby.",
      "web": "Apesar de ser um desenvolvedor web full-stack que consegue trabalhar perfeitamente tanto com o back quanto com o front-end, ultimamente tenho trabalhado mais com os \"músculos\" das interfaces. Estou acostumado a criar APPs com kits de interface do usuário disponíveis. No entanto, quando necessário, eu também as faço. Do lado do servidor, preocupo-me muito com a segurança e com as boas práticas para evitar problemas futuros."
    },
    "third": "Eu amo cachorros, música e pizza. No meu tempo livre, gosto de ir à academia, jogar videogame e desenvolver pequenos projetos.",
    "technologies": "Tecnologias que tenho utilizado ultimamente:"
  },
  "experience": {
    "title": "Educação e Trabalho",
    "experiences": {
      "roundstars": {
        "title": "Game Developer",
        "subtitle": "Programmer",
        "content": "Worked on single-player and multiplayer games, coding mechanics, AI bots, and interfaces. Contributed to a REST API for a gaming social media platform."
      },
      "adra_brasil": {
        "title": "Designer",
        "subtitle": "Automation & Design",
        "content": "Created art for fundraising campaigns, automated daily tasks, and developed a system to support food distribution for Venezuelan refugees."
      },
      "adven_tech": {
        "title": "Web Developer",
        "subtitle": "Fullstack",
        "content": "Developed web apps for stock management, events, and e-commerce. Migrated legacy systems and delivered scalable, maintainable solutions."
      },
      "autotrac": {
        "title": "Web Developer",
        "subtitle": "Front-end Focused",
        "content": "Built and improved Angular interfaces, adding features, refactoring components, and ensuring performance. Contributed to .NET back-end integration."
      },
      "iesb": {
        "title": "Associate Degree",
        "subtitle": "Game Development",
        "content": "Studied programming, art, and design in game development. Won an award for best game in 2017, also gained experience in web and app development."
      },
      "descomplica_systems": {
        "title": "Postgraduate",
        "subtitle": "Systems Analysis",
        "content": "Studied data structures, project management, DevOps, and theoretical aspects of system development."
      },
      "descomplica_mobile": {
        "title": "Postgraduate",
        "subtitle": "Mobile Development",
        "content": "Focused on hybrid frameworks and fundamentals of native iOS and Android apps."
      },
      "computer_science": {
        "title": "Bachelor’s Degree",
        "subtitle": "Computer Science",
        "content": "Studied algorithms, data structures, operating systems, software engineering, databases, and computer networks. Gained solid knowledge in programming, problem solving, and system design, preparing for roles in software development and technology innovation."
      }
    }
  },
  "projects": {
    "title": "Projetos",
    "instructions": "Passe o mouse no projeto para ver os links",
    "instructions_mobile": "Toque no projeto para ver os links",
    "projects": {
      "todo": {
        "name": "Lista de Tarefas",
        "description": "É um aplicativo de lista de tarefas simples. O desenvolvi principalmente para mostrar meu conhecimento técnico em Angular. Possui testes de unidade para funcionalidades básicas, é projetado visando para dispositivos móveis, tem suporte a PWA e usa o banco de dados em tempo real do firebase."
      },
      "trivia": {
        "name": "Perguntas e Respostas",
        "description": "É um jogo de perguntas simples desenvolvido pelo Open Trivia Database. Ele permite que você escolha um tópico, limite de tempo e outras configurações para personalizar sua experiência."
      },
      "secret_santa": {
        "name": "Amigo Secreto",
        "description": "Este pode ser o mais simples aqui. Eu o desenvolvi para ajudar com o amigo secreto da minha família. Ele permite que você crie um rapidamente e envie os links para os participantes para que eles possam ver quem eles tiraram."
      },
      "portfolio": {
        "name": "Portfólio",
        "description": "Esse tem como principal objetivo mostrar alguns dos meus projetos e falar um pouco sobre mim. Ele usa o SendingBlue para envio do email e uma única função na nuvem para mantê-lo seguro."
      },
      "pru": {
        "name": "Pru!",
        "description": "Pru! é um \"infinity runner\" sobre um pombo que precisa comer comida e pontuar acertando as pessoas com seu cocô enquanto evita obstáculos. Foi o primeiro jogo que desenvolvi na faculdade. Ele passou por algumas mudanças desde que pensei nele pela primeira vez."
      },
      "jimmy_gunner": {
        "name": "Jimmy Gunner",
        "description": "É um jogo de tiro que fiz enquanto brincava com voxel art na faculdade. É o jogo que me deu o prêmio de melhor jogo do semestre. Tentei refazê-lo alguns anos depois, mas deixei essa ideia de lado por causa da quantidade de jogos semelhantes disponíveis."
      },
      "slime_run": {
        "name": "Slime Run",
        "description": "Este jogo é sobre um mundo invadido por slimes. O trabalho do herói é se livrar deles pulando neles enquanto corre, deslizando e coletando moedas para serem usadas posteriormente em trajes."
      }
    }
  },
  "contact": {
    "title": "Entre Em Contato",
    "description": "Sinta-se à vontade para mandar uma mensagem, retornarei o quanto antes possível.",
    "form": {
      "name": {
        "label": "Nome",
        "required": "Nome é necessário",
        "max_length": "O nome é muito longo"
      },
      "email": {
        "label": "E-mail",
        "required": "E-mail é necessário",
        "not_valid": "E-mail não é válido"
      },
      "message": {
        "label": "Mensagem",
        "required": "A mensagem é necessária",
        "placeholder": "Escreva aqui sua mensagem",
        "max_length": "Por favor, escreva uma mensagem mais curta"
      },
      "submit_button": "enviar",
      "submit_success": {
        "title": "E-mail enviado com sucesso!",
        "description": "Obrigado pela mensagem. Farei o possível para respondê-lo em <strong>{{email}}</strong> o mais rápido possível",
        "button": "Enviar outra mensagem"
      },
      "submit_error": {
        "title": "Desculpe, parece que o e-mail não pôde ser enviado agora.",
        "description": "Mas não se preocupe, você pode tentar novamente mais tarde ou me enviar um e-mail manualmente para"
      }
    },
    "disabled_notice": "Sinto muito, precisei desativar o formulário de contato. Se você deseja falar comigo, por favor, envie um email para"
  },
  "common": {
    "made_by": "Feito com ❤️ por Artur Junior",
    "date": {
      "present": "presente"
    }
  },
  "job_instructions": {
    "text": "Olá, Embora eu tenha focado no desenvolvimento web ultimamente, também sou um desenvolvedor de jogos habilidoso. Você pode clicar a qualquer momento em \"Web\" ou \"Game\" para ver algumas mudanças no conteúdo da página.",
    "got_it": "Entendido"
  }
}